#+title: Aufgabenblätter Algorithmische Methoden
#+author: Jeldo Arno Meppen
#+email: jeldo@hey.com
#+date: [2020-12-13 Sun]
#+property: header-args :tangle yes
#+options: todo:nil toc:nil
#+html_head: <link rel="stylesheet" href="tufte.css" type="text/css" />
#+latex_header:\hypersetup{hidelinks}
#+latex_header:\usepackage{fontspec}
#+latex_header:\setmonofont[Scale = 0.9]{Hack}
#+latex_header:\setmainfont{Palatino}
#+latex_header:\usemintedstyle{lovelace}



*** DONE Überarbeitung als Listenabstraktion

#+begin_src python :results value scalar
  def finde(wortstamm, liste):
      return [wort for wort in liste if wortstamm in wort]

  in_ringelnatz = '''Ich wuerde dir ohne Bedenken Eine Kachel aus meinem Ofen Schenken Ich habe dir nichts getan Nun ist mir traurig zu Mut. An den Haengen der Eisenbahn Leuchtet der Ginster so gut. Vorbei - verjaehrt - Doch nimmer vergessen. Ich reise. Alles, was lange waehrt, Ist leise. Die Zeit entstellt Alle Lebewesen. Ein Hund bellt. Er kann nicht lesen. Er kann nicht schreiben. Wir koennen nicht bleiben. Ich lache. Die Loecher sind die Hauptsache An einem Sieb. Ich habe dich so lieb.'''.split(" ")

  return finde("ei", in_ringelnatz)
#+end_src

#+RESULTS:
: ['meinem', 'Vorbei', 'reise.', 'leise.', 'Zeit', 'schreiben.', 'bleiben.', 'einem']

